STRINGS = {
    1: """🎇 **- شكراً لتنصيبك سورس جمثون **
•• من الاسفل بعض الخيارات التي ستساعدك في جمثون.""",
  
    2: """🎉** حول جمثون**
🧿 جمثون هو يوزربوت في مكتبة التيليثون تم صنعه بأستخدام البايثون. يحتوي على اكثر من 100 أمر تساعدك في التليجرام و جمثون هو افضل سورس من ناحية الامان.
❣ قناة السورس **@jmthon**""",
  
    3: """**💡• قنوات السورس •**
قناة الكلايش:  @JJOTT
قناة الملاحظات: @RRRDF
قناة السورس: @JMTHON
قناة المساعدة: @JMTHON_HELP
مجموعة المساعدة: @JMTHON_SUPPORT""",
  
    4: f"""• `لمعرفة جميع اوامر السورس ارسل`
  - `.اوامري`
  - `.الاوامر`""",
  
    5: """• **لأي مساعدة ثانية **
  - أنضم في مجموعة المساعدة **@jmthon_support**.
• شكرا لك لقرائتك هذه المقالة.""",
  
}
